# Используем образ golang:latest в качестве базового
FROM golang:latest

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем содержимое текущей директории (проект Go) внутрь контейнера
COPY . .

# Загружаем зависимости и собираем приложение
RUN go mod download
RUN go build -o auth-service ./cmd/app

# Устанавливаем переменную среды PORT для приложения
ENV PORT=8080

# Определяем порт, который будет прослушивать наше приложение
EXPOSE 8080

# Запускаем приложение при старте контейнера
CMD ["./auth-service"]